---
title: Ceramic
classe: Autodesk.Revit.DB.Visual.Ceramic
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# Ceramic

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CeramicApplication { get; }` | `Ceramic.CeramicApplication` | String |
| `String CeramicBump { get; }` | `Ceramic.CeramicBump` | String |
| `String CeramicBumpAmount { get; }` | `Ceramic.CeramicBumpAmount` | String |
| `String CeramicBumpMap { get; }` | `Ceramic.CeramicBumpMap` | String |
| `String CeramicColor { get; }` | `Ceramic.CeramicColor` | String |
| `String CeramicColorByObject { get; }` | `Ceramic.CeramicColorByObject` | String |
| `String CeramicPattern { get; }` | `Ceramic.CeramicPattern` | String |
| `String CeramicPatternAmount { get; }` | `Ceramic.CeramicPatternAmount` | String |
| `String CeramicPatternMap { get; }` | `Ceramic.CeramicPatternMap` | String |
| `String CeramicType { get; }` | `Ceramic.CeramicType` | String |
| `String CommonTintColor { get; }` | `Ceramic.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `Ceramic.CommonTintToggle` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```